const { vehicleList, carList, busList } = require('./vehicleData')
const { update, checkUpdate } = require('./service')


// // APP F/W=============================================================
// // 이전버전 BTM_2.18.0.22 (254)
// // 최근버전 BTM_2_18_0_23 (255)
// // APP 펌웨어 업데이트(공통)
update(vehicleList, 255)


// // 승용=============================================================
// // 이전버전 BCM_7.18.3.20 (252)
// // 최근버전 BCM_7.18.3.22 (256)
// // OBD 펌웨어 업데이트(승용)
update(carList, 256)


// // 상용(버스)=============================================================
// // 이전버전 BCM_7.68.3.20 (253)
// // 최근버전 BCM_7.68.3.22 (257)
// // OBD 펌웨어 업데이트(상용)
update(busList, 257)


// // 펌웨어 업데이트 체크
checkUpdate(carList)